In [1]:
!source ./ashu-env/bin/activate

In [2]:
# importing python pandas 
import pandas as pd

In [3]:
# creating dataframe
ashu_data = {
    'name' : ['ashu','luis','jack'],
    'age':  [27,35,30],
    'city': ['New York','Los Angeles','chicago']
}

df = pd.DataFrame(ashu_data)
print(df)

   name  age         city
0  ashu   27     New York
1  luis   35  Los Angeles
2  jack   30      chicago

In [4]:
# basic Operations 
print(df.head())

   name  age         city
0  ashu   27     New York
1  luis   35  Los Angeles
2  jack   30      chicago

In [5]:
# selecting columns 
df['name']

0    ashu
1    luis
2    jack
Name: name, dtype: object

In [6]:
# multiple columns 
df[['name','age']]

   name  age
0  ashu   27
1  luis   35
2  jack   30

In [8]:
df[df['age'] > 30 ]

   name  age         city
1  luis   35  Los Angeles

In [9]:
# adding column 
df['salary'] =  [80000,65000,70000]
df

   name  age         city  salary
0  ashu   27     New York   80000
1  luis   35  Los Angeles   65000
2  jack   30      chicago   70000

In [10]:
# groupby 
df.groupby('city')['age'].mean()

city
Los Angeles    35.0
New York       27.0
chicago        30.0
Name: age, dtype: float64

In [3]:
# Starting using dask dataframe 
import dask.dataframe as dd
df2 = dd.read_csv('https://raw.githubusercontent.com/redashu/Datasets/refs/heads/master/large_dataset.csv')
df2

Dask DataFrame Structure:
                  ID    Name    Age    City   Salary
npartitions=1
               int64  string  int64  string  float64
                 ...     ...    ...     ...      ...
Dask Name: to_string_dtype, 2 expressions
Expr=ArrowStringConversion(frame=FromMapProjectable(5950c4c))

In [4]:
# printing this info 
print(df2)

Dask DataFrame Structure:
                  ID    Name    Age    City   Salary
npartitions=1
               int64  string  int64  string  float64
                 ...     ...    ...     ...      ...
Dask Name: to_string_dtype, 2 expressions
Expr=ArrowStringConversion(frame=FromMapProjectable(5950c4c))

In [5]:
# print top 5 rows
df2.head()

   ID     Name  Age      City     Salary
0   1      Bob   33   Phoenix  104608.15
1   2  Charlie   25  New York   42922.03
2   3    Alice   55   Chicago   40155.43
3   4      Bob   18   Chicago   36625.62
4   5  Charlie   30   Houston  101225.42

In [6]:
# default checking number of partitions 
df2.npartitions

1

In [8]:
# Filtering rows
filter_output = df2[df2['Age'] >35]

In [9]:
print(filter_output)

Dask DataFrame Structure:
                  ID    Name    Age    City   Salary
npartitions=1
               int64  string  int64  string  float64
                 ...     ...    ...     ...      ...
Dask Name: getitem, 5 expressions
Expr=Filter(frame=ArrowStringConversion(frame=FromMapProjectable(5950c4c)), predicate=ArrowStringConversion(frame=FromMapProjectable(5950c4c))['Age'] > 35)

In [11]:
# use group by 
ashu_group = df2.groupby('City')['Age'].mean()

In [12]:
print(ashu_group)

Dask Series Structure:
npartitions=1
    float64
        ...
Dask Name: getitem, 5 expressions
Expr=((ArrowStringConversion(frame=FromMapProjectable(5950c4c))[['Age', 'City']]).mean(observed=False, chunk_kwargs={'numeric_only': False}, aggregate_kwargs={'numeric_only': False}, _slice='Age'))['Age']

In [13]:
# calling action funcation 
filter_output.compute()

          ID   Name  Age         City     Salary
2          3  Alice   55      Chicago   40155.43
7          8  David   56      Phoenix   87637.78
8          9  Alice   40      Phoenix   67813.78
9         10    Bob   47      Phoenix   38681.44
11        12  Alice   44  Los Angeles  109205.52
...      ...    ...  ...          ...        ...
99991  99992  David   64     New York  116105.58
99992  99993    Eva   37  Los Angeles   70851.86
99993  99994    Eva   52      Houston  104017.66
99995  99996  Alice   56     New York   32433.29
99997  99998    Eva   64      Houston   83727.26

[61700 rows x 5 columns]

In [14]:
ashu_group.compute()

City
Chicago        41.056368
Houston        40.974150
Los Angeles    41.013196
New York       40.943020
Phoenix        41.023580
Name: Age, dtype: float64

In [15]:
# save output of compute results 
filter_new1 = filter_output.compute()

In [ ]:
filter_new1.to